app/controllers/api/v1/audit_logs_controller.rb

SELECT "audit_logs".* FROM "audit_logs" ORDER BY "audit_logs"."created_at" DESC
---
      def index
        audit_logs = AuditLog.order(created_at: :desc)