app/controllers/api/v1/distances_controller.rb

      def index
        render json: DistanceTable.all, status: :ok
---
SELECT "distance_tables".* FROM "distance_tables"