app/controllers/events_controller.rb

SELECT "cycles".* FROM "cycles" WHERE "cycles"."cycle_id" = $1 LIMIT $2  [["cycle_id", "cycle-status-1"], ["LIMIT", 1]]
---
  def create
    payload = params.except(:controller, :action).permit!.to_h

    begin
      case payload['type']
      when 'transfer', 'demand-statement'
        if LedgerProcessorService.call(payload)
          render json: { status: 'saved' }, status: :created
        else
          render json: { status: 'duplicate', detail: 'IDPK already exists' }, status: :ok
        end

      when 'distance-table'
        DistanceTableProcessorService.call(payload)
        render json: { status: 'saved' }, status: :created

      when 'status-statement'
        energy = payload.fetch('data').fetch('energy')
        cycle = Cycle.find_or_initialize_by(cycle_id: payload['cycleId'])