app/jobs/cycle_orchestrator_job.rb

  def perform
    now = Time.current

    # Buscar el status-statement más reciente en la BD
    latest_status = DemandEvent.where(event_type: 'status-statement')
                               .order(created_at: :desc)
                               .first
---
SELECT "demand_events".* FROM "demand_events" WHERE "demand_events"."event_type" = 'status-statement' ORDER BY "demand_events"."created_at" DESC LIMIT 1